package com.taomee.seer2.app.processor.quest.handler.main.quest115 {
import com.taomee.seer2.app.dialog.NpcDialog;
import com.taomee.seer2.app.processor.quest.QuestProcessor;
import com.taomee.seer2.app.processor.quest.handler.QuestMapHandler;
import com.taomee.seer2.app.quest.QuestManager;
import com.taomee.seer2.app.utils.MovieClipUtil;
import com.taomee.seer2.core.scene.SceneManager;
import com.taomee.seer2.core.scene.SceneType;

import flash.display.DisplayObject;
import flash.display.MovieClip;
import flash.events.MouseEvent;

public class QuestMapHandler_115_80584 extends QuestMapHandler {


    private var _dialogs1:Array;

    private var _dialogs2:Array;

    private var _dialogs3:Array;

    public function QuestMapHandler_115_80584(param1:QuestProcessor) {
        this._dialogs1 = [[519, "奥罗吉尔", [[0, "我是风刃氏族最美丽的风，奥罗吉尔。由于既不擅长对战又对机械一窍不通，所以我经常被族人轻视。直到有一天，我遇到了一个铁皮博士，他命令我帮他看守一个地方。 "]], ["……"]], [519, "奥罗吉尔", [[0, "但是我……又搞砸了。因为这几个小铁皮，我又被博士嫌弃了。但是，小铁皮似乎不嫌弃我，还让我帮助他们。虽然有点不平稳，但是我还是带着他们来到了目的地。"]], ["……"]], [400, "小赛尔", [[0, "于是我看到了这个场面……"]], ["天啦噜这是怎么回事？！"]], [400, "小赛尔", [[0, "我检查了一下，看上去没有大问题，我们需要等待帮助……不过话说回来，那个罐子里的是什么？刚才又发生了什么？ "]], ["诶？我看看……有点眼熟呢。"]], [11, "多罗", [[0, "来人啊！救命啊！快来救救巴蒂和这个不知道是什么的小精灵啊！ "]], ["倒在地上的那个家伙我好像也见过？"]], [3126, "纽伊斯特", [[0, "来啦来啦！别催了！我们也是火急火燎地赶来的！ "]], ["这谁啊？"]]];
        this._dialogs2 = [[400, "小赛尔", [[0, "这不是娜娜工程师吗？旁边又有一个铁皮？ "]], ["……"]], [400, "小赛尔", [[0, "娜娜工程师，欢迎。旁边这位是……？ "]], ["天啊好多铁皮！"]], [11, "多罗", [[0, "你……你是纽伊斯特！老久没见了你还好吧？！我想死你了！ "]], ["这个笨蛋一样的家伙难道是社交达人？"]], [3126, "纽伊斯特", [[0, "哈哈多罗，你小子还是这么神经兮兮的！我好得很！最近在风刃氏族和娜娜切磋修理技术，颇有收获啊！ "]], ["娜娜这么厉害的，你是何方神圣？"]], [148, "娜娜", [[1, "（抬头）这是……这是我们氏族的瞳魂兽！果然，卡多斯的预言实现了！ "]], ["诶诶诶？！我就说怎么这么眼熟！"]], [519, "奥罗吉尔", [[0, "（对着容器里的身影）奥罗吉尔诚惶诚恐……拜见瞳魂兽大人！"]], ["……"]], [148, "娜娜", [[1, "现在没时间说这么多废话，待我看看倒在地上的那两位再说！"]], ["……"]], [3126, "纽伊斯特", [[0, "好的！那么我也开始工作了！来自远古洪荒的修理之力啊，我以纽伊斯特的名义召唤你！哇啊啊啊啊！ "]], ["这……这是什么？"]], [11, "多罗", [[0, "兄弟，拜托你救救巴蒂！这恩情我终身难忘！ "]], ["如果我也有这么仗义的朋友就好了……"]], [3126, "纽伊斯特", [[0, "放心吧兄弟！我以纽伊斯特的名义发誓！没有我修不好的东西！ "]], ["如果我也这么厉害就好了……"]]];
        this._dialogs3 = [[3124, "诗风", [[0, "帝高阳之苗裔兮，朕皇考曰伯庸……诗风不才，拜见瞳魂兽大人！ "]], ["啊你是诗风啊……等等你在叫谁？"]], [148, "娜娜", [[1, "还是搞定了！等等……这是什么？这气场，这感觉！你是谁？ "]], ["这这这怎么回事？"]], [11, "多罗", [[0, "巴蒂你终于醒了！我们找你找得好苦啊！……等等，有点……不对劲？ "]], ["别……别吓我啊，有什么可怕的东西？"]], [3127, "瞳魂兽", [[0, "啊，旁边这位铁皮先生，您是厨师还是修理工呢？ "]], ["果然不是巴蒂！"]], [3126, "纽伊斯特", [[0, "我是赛……2飞船后勤……队长纽伊斯特，专攻机械修理和料理。敢问阁下尊姓大名？"]], ["喂，瞳瞳瞳魂兽大人在和你说话诶！"]], [3127, "瞳魂兽", [[0, "风刃氏族，瞳魂兽。 "]], ["果然是瞳魂兽大人！但是为什么会这样出现啊！"]], [519, "奥罗吉尔", [[0, "奥罗吉尔诚惶诚恐，拜见……瞳魂兽大人！"]], ["……"]], [148, "娜娜", [[1, "尊敬的瞳魂兽大人，风刃氏族子民娜娜拜见。 "]], ["……"]], [400, "小赛尔", [[0, "尊敬的瞳魂兽，我是星际使者。 "]], ["……"]], [3127, "瞳魂兽", [[0, "星际使者啊，我早已听闻你的大名了。我想你们现在一定很想知道，我为什么会在这里，又为什么会借用巴蒂的机体…… "]], ["我也很想知道！"]], [3127, "瞳魂兽", [[0, "我被拘禁在这里，已有一段时间了。我的力量大部分都被抽离，而且这个容器隔绝了我和外界的力量联系，我无法使用我的力量，只能静静地等待…… "]], ["……为什么？谁要对我的，啊不我们的瞳魂动手？"]], [148, "娜娜", [[1, "可恶！究竟是谁能让我风刃氏族的魂兽沦落到这个地步？我一定亲手拆了他！"]], ["是啊是啊！瞳魂兽大人是我们大家的！"]], [400, "小赛尔", [[0, "这个手段……应该是斯坦因。"]], ["斯坦因？听着好耳熟……等等，不就是博士吗？"]], [3127, "瞳魂兽", [[0, "而就在这时，这个勇气可嘉的小姑娘以一己之力撞向了这个容器，那一瞬间，我感到自己再次获得了和外界力量的联系，但是我体内留下的力量实在太小了，只能在她的机体里暂且“寄居”。 "]], ["瞳魂兽大人真机智啊！"]], [400, "小赛尔", [[0, "巴蒂这么做，想必是在模仿刚铎吧……用外力强制破坏容器，可是她居然会自己撞上去？"]], ["……"]], [3126, "纽伊斯特", [[0, "那么，瞳魂兽，这只小精灵呢？我刚刚给它喂了几块精灵饼干，它才恢复起来。 "]], ["虽然很厉害的样子但是吃多了会不会发胖？"]], [3127, "瞳魂兽", [[0, "它说“捐躯赴国难，视死忽如归”，然后将自己的力量分给了我。很感谢它。"]], ["诗风得到了了瞳魂兽大人的赞赏！好羡慕！"]], [3124, "诗风", [[0, "宠命优渥，不胜感激。 "]], ["……"]], [148, "娜娜", [[1, "那么瞳魂兽大人，务必告诉我是谁造成了这一切！不拆了它我誓不为娜娜！"]], ["博士……他究竟是什么人啊？"]], [3127, "瞳魂兽", [[0, "就是星际使者刚才嘀咕的“斯坦因”啊，平心静气的去聆听风声，往往更能获得真相。"]], ["……"]], [11, "多罗", [[0, "斯坦因……是……是他！一个怪老头！他曾经把翼灵兽也锁在了罐子里！"]], ["翼灵兽？这名字的风格不像是南半球的……？"]], [3127, "瞳魂兽", [[0, "翼灵兽啊，感觉很美丽的神兽，虽然是北半球的……关于斯坦因的风声，我之前也略有耳闻，但是没想到他竟疯狂到如此地步。"]], ["为什么瞳魂兽大人偏偏没有提到我……伐开心！"]], [148, "娜娜", [[1, "可恶……那个叫斯坦因的，老铁皮对吧？为了风刃氏族的尊严我一定不会饶过他的！"]], ["你……你们动手轻一点……"]], [148, "娜娜", [[1, "喂，你就是那个爱美的小花瓶吧？为什么总是在一边嘀咕那个老铁皮的有关内容？你是不是他派来的卧底？ "]], ["我才不是花瓶！"]], [148, "娜娜", [[1, "那你是不是他的卧底？平常无所事事就被他派来监视我们？ "]], ["……我不是！才不是呢！"]], [3127, "瞳魂兽", [[0, "娜娜，注意你的言辞。虽然足够犀利，但是缺乏对环境的敏锐判断，犀利也只是虚张声势。你应该注意到她的言辞内容。 "]], ["瞳魂兽大人……在替我辩护！好感动！"]], [148, "娜娜", [[1, "（想了想）……内容么？这样想来她确实认识老铁皮，但是比起老铁皮，她的脑子里更多的是博得您的关注吧？"]], [" 不……不要这么直白的说出来啊！"]], [3127, "瞳魂兽", [[0, "娜娜此语果真犀利，一语中的啊。"]], [" 瞳魂兽大人……请原谅我！"]], [3127, "瞳魂兽", [[0, "你不应该说这话的，你难道没有看出，我一点都不生气？作为风刃氏族的时尚达人，你要知道，人们的心态是判断时尚潮流的一大因素。 "]], ["您怎么什么都知道？好厉害！"]], [3124, "诗风", [[0, "大人之风岂是凡夫能比？然其将衰，离散转移，落于狂人之手…… "]], ["好像大概懂你的意思……"]], [400, "小赛尔", [[0, "神兽是氏族尊严的象征，但是科学怪人罔顾这一切……就算是有着怎样冠冕堂皇的理由，斯坦因的这种行为也不能被认可！"]], ["……"]], [11, "多罗", [[0, "队长说的对！队长说得好！斯坦因这个怪……怪老头！"]], ["……"]], [148, "娜娜", [[1, "还是铁皮仗义！无论怎样还是找斯坦因这老家伙算账！ "]], ["好啊，不过不要把他打坏了……"]], [3127, "瞳魂兽", [[0, "星际使者的沉稳行事风格，我十分佩服。你现在想必在考虑，斯坦因行踪不定，还是先找回瞳魂兽丢失的力量为好，对么？"]], ["瞳魂兽大人又开始推测了！"]], [400, "小赛尔", [[0, "你们似乎个个都会读心术啊。 "]], ["那是当然！尤其是瞳魂兽大人！"]], [3127, "瞳魂兽", [[0, "掌握情报，察言观色，这是风刃氏族的技巧。现在我已经能感受到我的力量被斯坦因放置在哪里了……风刃氏族多年的禁忌之地，娜娜，带他们去吧。"]], ["……"]], [148, "娜娜", [[1, "是的，瞳魂兽大人。果然卡多斯的预言没错……“跟随星际使者的友人，你将窥探氏族最深层的秘密”。我们走吧。 "]], ["走，去哪里？带上我带上我！"]]];
        super(param1);
    }

    override public function processMapComplete():void {
        if (QuestManager.isComplete(_quest.id)) {
            return;
        }
        if (!QuestManager.isAccepted(_quest.id)) {
            SceneManager.changeScene(SceneType.COPY, 80585);
            return;
        }
        SceneManager.active.mapModel.content["item"].addEventListener(MouseEvent.CLICK, this.onItemClick);
    }

    private function onItemClick(param1:MouseEvent):void {
        var e:MouseEvent = param1;
        SceneManager.active.mapModel.content["tip"].visible = false;
        (e.currentTarget as DisplayObject).removeEventListener(MouseEvent.CLICK, this.onItemClick);
        NpcDialog.showDialogs(this._dialogs1, function ():void {
            var mv0:MovieClip = SceneManager.active.mapModel.content["mv0"];
            mv0.visible = true;
            mv0.gotoAndPlay(1);
            MovieClipUtil.playMc(mv0, 2, mv0.totalFrames, function ():void {
                NpcDialog.showDialogs(_dialogs2, function ():void {
                    var mv1:MovieClip = SceneManager.active.mapModel.content["mv1"];
                    mv1.visible = true;
                    mv1.gotoAndPlay(1);
                    MovieClipUtil.playMc(mv1, 2, mv1.totalFrames, function ():void {
                        NpcDialog.showDialogs(_dialogs3, function ():void {
                            QuestManager.completeStep(questID, 1);
                            SceneManager.changeScene(SceneType.LOBBY, 70);
                        });
                    });
                });
            });
        });
    }
}
}
