package com.taomee.seer2.app.processor.quest.handler.main.quest102
{
   import com.taomee.seer2.app.dialog.NpcDialog;
   import com.taomee.seer2.app.processor.quest.QuestProcessor;
   import com.taomee.seer2.app.processor.quest.handler.QuestMapHandler;
   import com.taomee.seer2.app.quest.QuestManager;
   
   public class QuestMapHandler_102_80517 extends QuestMapHandler
   {
       
      
      public function QuestMapHandler_102_80517(param1:QuestProcessor)
      {
         super(param1);
      }
      
      override public function processMapDispose() : void
      {
         super.processMapDispose();
      }
      
      override public function processMapComplete() : void
      {
         super.processMapComplete();
         if(QuestManager.isComplete(_quest.id))
         {
            return;
         }
         if(!QuestManager.isAccepted(_quest.id))
         {
            return;
         }
         if(QuestManager.isStepComplete(_quest.id,1) == true && QuestManager.isStepComplete(_quest.id,2) == false)
         {
            this.initStep2();
         }
      }
      
      private function initStep2() : void
      {
         var dialog:Array = [[400,"小赛尔",[[0,"斯坦因！被你推下去之后，我就被传送到了这里！！我想起来了！！"]],["......"]],[106,"斯坦因",[[0,"很对，那么，巴蒂呢？她去了哪里？"]],["是啊……巴蒂去了哪里？"]],[400,"小赛尔",[[0,"（一时语塞）巴蒂她……她……我想不起来了，大概被传送回飞船了吧？我不知道……"]],["要不我问问她？"]],[3100,"风暴伊特",[[0,"（探出头来）嘿，反正不会有事的，那下面摔不死人！"]],["......"]],[400,"小赛尔",[[0,"……你谁啊？"]],["看起来很眼熟的样子。"]],[106,"斯坦因",[[0,"(语气平静，莫名带着点慈爱）风暴伊特啊，来和这位打个招呼吧。"]],["......"]],[3100,"风暴伊特",[[0,"就是这个铁皮？我还以为是什么大人物呢！"]],["这么不屑的语气是怎么回事？！"]],[400,"小赛尔",[[0,"我可是星际使者，别随便就看不起人啊！"]],["......"]],[3100,"风暴伊特",[[0,"星际使者又如何？不好意思。我只认可我眼前看到的东西。过去的头衔什么的都是虚名，我才不稀罕呢。"]],["......"]],[400,"小赛尔",[[0,"（自信）好啊，我随时奉陪！"]],["......"]],[3100,"风暴伊特",[[0,"（意味不明地笑）好了，既然我们达成了初步共识。现在来谈谈你和影灵兽的相遇吧。"]],["......"]],[400,"小赛尔",[[0,"那是在能源之潮战役的时候。这就是我疑惑的地方了，影灵兽分明是“灵兽”却和萨伦帝国一起攻打北半球的能源之潮。"]],["更何况……"]],[106,"斯坦因",[[0,"这就对了……桀桀桀，其中最令你不解的那一点是什么？影灵兽是为何而来的？"]],["......"]],[400,"小赛尔",[[0,"为何而来？……不就是要帮萨伦帝国……（惊）"]],["等等……这不就是我想起来的那件事吗？！"]],[400,"小赛尔",[[0,"他们要……夺走【希望之光】！！！"]],["......"]],[106,"斯坦因",[[0,"你不会不知道希望之光是用来干什么的，对么？"]],["......"]],[400,"小赛尔",[[0,"用来……（似乎倒吸一口冷气）【唤醒精灵王约瑟】！！！"]],["......"]],[106,"斯坦因",[[0,"这就是了，想想现在的情况吧，你会明白的。"]],["......"]],[400,"小赛尔",[[0,"（如雷轰顶）这……为什么现实会是这样？！这么长时间以来，我们忘了什么？我们又做了什么？……"]],["......"]],[106,"斯坦因",[[0,"（感叹）不仅忘了，还不去想，这就是悲哀啊……不过我在一段时间里也是这样的，我很庆幸，比起你们，“老朽”的我把一些重要的记忆备份了。在现在我倒是记起来了一些，至少我当年给巴蒂设置的传送点可不是在飞船。"]],["……那是哪里？"]],[400,"小赛尔",[[0,"（有些慌）我怎么才能相信你……？不，我不得不相信你，你也许比我知道得多……"]],["......"]],[106,"斯坦因",[[0,"（笑）也许是吧，不过，你最好亲自去找找，不然的话，可能会有很大的麻烦……桀桀桀"]],["......"]],[400,"小赛尔",[[0,"（惊讶）{我似乎已经无话可说了，但是那些话又像是被什么堵住了，什么都说不出来}"]],["这……究竟是怎么回事？"]],[106,"斯坦因",[[0,"现在我们算是盟友。如果你想知道什么，自己去飞翼氏族的研究院看看吧。（斯坦因把一枚【银色的芯片】递给了我）。"]],["......"]],[400,"小赛尔",[[0,"这芯片是？"]],["......"]],[106,"斯坦因",[[0,"【钥匙】。但愿你能尽快想明白，桀桀桀……"]],["......"]],[400,"小赛尔",[[0,"能被您看做盟友，这真是……{感觉很别扭，但是现在也只能这样了}斯坦因先生，这东西我一定会调查清楚的！"]],["（坚定）那时，我们再来好好谈谈！"]],[106,"斯坦因",[[0,"桀桀桀，那就祝你好运……（斯坦因的笑容有些阴森，也有些沉重。）"]],["......."]]];
         NpcDialog.showDialogs(dialog,function():void
         {
            QuestManager.completeStep(_quest.id,2);
         });
      }
   }
}
