package com.taomee.seer2.app.processor.quest.handler.main.quest105
{
   import com.taomee.seer2.app.dialog.NpcDialog;
   import com.taomee.seer2.app.processor.quest.QuestProcessor;
   import com.taomee.seer2.app.processor.quest.handler.QuestMapHandler;
   import com.taomee.seer2.app.quest.QuestManager;
   import com.taomee.seer2.app.utils.MovieClipUtil;
   import com.taomee.seer2.core.scene.SceneManager;
   import com.taomee.seer2.core.scene.SceneType;
   import com.taomee.seer2.core.utils.URLUtil;
   import flash.display.MovieClip;
   import flash.events.MouseEvent;
   
   public class QuestMapHandler_105_80523 extends QuestMapHandler
   {
       
      
      public function QuestMapHandler_105_80523(param1:QuestProcessor)
      {
         super(param1);
      }
      
      override public function processMapComplete() : void
      {
         if(!QuestManager.isAccepted(_quest.id))
         {
            this.initStep0();
         }
      }
      
      private function initStep0() : void
      {
         var _loc1_:MovieClip = null;
         _loc1_ = _processor.resLib.getMovieClip("duoLuo");
         _loc1_.x += 450;
         _loc1_.y += 100;
         SceneManager.active.mapModel.front.addChild(_loc1_);
         _loc1_.buttonMode = true;
         _loc1_.mouseChildren = false;
         _loc1_.addEventListener(MouseEvent.CLICK,this.onClick);
      }
      
      protected function onClick(param1:MouseEvent) : void
      {
         var dialog0:Array = null;
         var dialog1:Array = null;
         var e:MouseEvent = param1;
         var dialog:Array = [[400,"小赛尔",[[0,"巴蒂，调查有什么进展？"]],["......"]],[10,"巴蒂",[[0,"队长，我发现了一处加密的资料，加密方法是我以前见过的。我问了刚铎，他说飞翼氏族没有这样的密码，于是我可以确定这应该是斯坦因留下的。"]],["看来斯坦因……很看好我们？"]],[10,"巴蒂",[[0,"最聪明的我才不屑他呢！"]],["........"]],[10,"巴蒂",[[0,"总之，我打开了那份资料，队长你看看吧。。"]],["。。。。。"]]];
         dialog0 = [[400,"小赛尔",[[0,"这样说来，你的推测是正确的。"]],["......"]],[10,"巴蒂",[[0,"当然，我是最聪明的！"]],["不过，斯坦因比我们想象中的更疯狂啊。"]],[10,"巴蒂",[[0,"正如你看到的，其中的一些数据还未完善，资料附带着没有计算完成的公式。接下来我要着手处理这些东西了，也许会有进展。不过在这之前……"]],["我似乎听到了奇怪的声音？"]],[11,"多罗",[[0,"呜呜呜……太感人了……实在是太感人了……"]],["。。。。。"]],[400,"小赛尔",[[0,"……他怎么了？"]],["......"]],[10,"巴蒂",[[0,"谁知道呢，也许是看到了什么虐心感情史？无法理解。"]],["......."]]];
         dialog1 = [[3107,"布克",[[0,"呔！这小生径直走向书柜，第一眼就瞅到了拿一本淡粉红色的罗曼史。"]],["什么？"]],[10,"巴蒂",[[0,"漂浮的大书？你是……布克？！"]],[".。。。。。。"]],[3107,"布克",[[0,"认得我？看起来有布布从这儿飞出去过啊。我们向来在这云海藏书生活，如你所见，我们看起来和书一模一样。"]],["......"]],[400,"小赛尔",[[0,"大书……呃不对，布克。我们是来这里寻找真相的。"]],["。。。。。"]],[3107,"布克",[[0,"真是单刀直入。年轻人啊，要窥探云海藏书的秘密吗？"]],["语言风格变得好快！"]],[400,"小赛尔",[[0,"我们在这里看到了有关我们丢失的，重要的记忆的线索。"]],["......."]],[3107,"布克",[[0,"哦吼吼吼，云海藏书的资料可是出奇的齐全啊！祝你们好运！"]],["那么，布克，你能给我们一些帮助吗？"]],[3107,"布克",[[0,"哎，年轻人不要心急，我只是生活在这里、注视着这里的运转而已，至于这些书里写的是啥，我又不是全都知道。不过那位小生拿的书我倒是看过……"]],["看来你也没办法帮上我们啊"]],[10,"巴蒂",[[0,"看来我们依旧要自食其力了。"]],["。。。。。"]],[3107,"布克",[[0,"真是年轻壮志啊！希望在于你们，加油吧！"]],["会的，因为希望在于我们！"]],[11,"多罗",[[0,"队……队长，实在是太感人了……不对，叫我有什么事吗？"]],["……当然有事。"]],[400,"小赛尔",[[0,"现在来梳理一下我们所获得的线索吧。"]],["。。。。。"]],[11,"多罗",[[0,"感觉很厉害的样子……"]],["......"]],[10,"巴蒂",[[0,"是很厉害。首先，我们都发现自己丢失了记忆，这点就连多罗都意识到了对吧？"]],["看来斯坦因……很看好我们？"]],[11,"多罗",[[0,"是的……哎？感觉哪里有点不对？"]],["连巴蒂的嘲讽都没听出来……）"]],[400,"小赛尔",[[0,"这一点现在已经毋庸置疑。刚铎向我们保证过这里资料的真实性。现在失去记忆这件事已经被证明了。"]],["。。。。。"]],[10,"巴蒂",[[0,"接下来是研究院的设施。现在已经证明这是精灵神经网络联系系统，它的原理应该是通过神经网络将大量的记忆拼接起来，从而找到记忆的“空白”之处，并且通过原有的线索推理出“空白”里所发生的事。"]],["......"]],[10,"巴蒂",[[0,"大概了解了。不过这份资料里还是没有设施的启动方式吗？"]],["看来斯坦因……很看好我们？"]],[400,"小赛尔",[[0,"是的。启动方式还不知道，所以这段时间我只能完善关于这个设施的数据，但是还是无法开启它。"]],["........"]],[10,"巴蒂",[[0,"那么……我们还找不到失去的记忆？"]],["。。。。。"]],[11,"多罗",[[0,"是的，而且对于启动方式，斯坦因居然没留下线索……？"]],["......"]],[400,"小赛尔",[[0,"这可怎么办啊！万一我忘了谁借过我的钱怎么办？"]],["。。。。。"]],[11,"多罗",[[0,"……队长我们继续。"]],["......"]],[10,"巴蒂",[[0,"队长还记得咱们上次看到的那本书吗？那本书简略的记载了我们的南半球行程，从风刃氏族到虫群氏族到超能氏族，然后记载中断。也就是说，我们失去的记忆，可不止那么一点啊……"]],["真没想到居然忘了这么多"]],[400,"小赛尔",[[0,"……想来也是，现在关于那段时间的“记忆”十分混乱而且不合理，直到暗影氏族我才意识到……。"]],["......."]],[11,"多罗",[[0,"也就是说……我们忘了好多好多？妈呀我没有倾家荡产吧？我……我要赶紧查查我的赛尔豆和钻石余额…………。"]],["......."]],[10,"巴蒂",[[0,"反正一切都已经发生过了，现在我们只能找回……但是我们究竟要等到什么时候才能找回呢？"]],["......."]],[400,"小赛尔",[[0,"是啊……究竟要到什么时候？为什么斯坦因的线索会在这里中断？真相明明触手可及，但是却断开了？"]],["......."]],[10,"巴蒂",[[0,"诸位，工作进行的怎么样？有没有找到你们的真相啊？"]],["......"]],[11,"多罗",[[0,"大叔你就别说这话了……好不容易找到的线索，好不容易确定的真相，又断开了。。"]],["......."]],[93,"刚铎",[[0,"（想了想）嗯，也就是说在离真相还有一步之遥的时候停住了？"]],["（我一直好奇刚铎这有迷之诗意的语言究竟是怎么回事）"]],[400,"小赛尔",[[0,"是这样的。"]],["。。。。。"]],[93,"刚铎",[[0,"既然一时半会找不到答案，那么不如去放松一下？"]],["......"]],[11,"多罗",[[0,"叔叔我们不约……"]],["......."]],[10,"巴蒂",[[0,"刚铎先生，别理他，最近他不知道看了些什么资料，似乎受刺激了。"]],["不，他好像是受刺激专业户。"]],[400,"小赛尔",[[0,"刚铎先生的提议不错，既然现在走不通，那么暂且放下，转变一下思路也好。。"]],["。。。。。"]],[93,"刚铎",[[0,""]],["。。。。。"]],[11,"多罗",[[0,"哎？去有意思的地方？带上我带上我！……只要不危险就好。"]],["......"]],[93,"刚铎",[[0,"当然安全，你们放心好了，我在飞翼氏族的信誉那是顶呱呱的！跟我走没问题！"]],["......"]]];
         NpcDialog.showDialogs(dialog,function():void
         {
            MovieClipUtil.playNpcTalkNew(URLUtil.getQuestNpcTalkAnimation("105_0"),1,[[1,0]],function():void
            {
               NpcDialog.showDialogs(dialog0,function():void
               {
                  var movie1:MovieClip = _processor.resLib.getMovieClip("buKe");
                  movie1.x += 246;
                  movie1.y += 170;
                  SceneManager.active.mapModel.front.addChild(movie1);
                  MovieClipUtil.playMc(movie1,2,movie1.totalFrames,function():void
                  {
                     NpcDialog.showDialogs(dialog1,function():void
                     {
                        QuestManager.accept(_quest.id);
                        SceneManager.changeScene(SceneType.COPY,80525);
                     });
                  });
               });
            });
         });
      }
   }
}
